In [1]:
import pandas as pd
import sqlite3 as sql

In [2]:
con=sql.connect('sql-murder-mystery.db')

In [3]:
query1='''
select * from crime_scene_report where city="SQL City"
ORDER by date;
'''
pd.set_option('display.max_colwidth',None)
pd.read_sql_query(query1,con)

,date,type,description,city
0,20170712,theft,"A lone hunter stalks the night, firing arrows into the Darkness.\n There is no hiding, no escape. In the distance, the beast\n falters, tethered to the void. The killing blow comes without\n hesitation, without mercy.",SQL City
1,20170820,arson,"Wield the Hammer of Sol with honor, Titan, it is a thing of\n legend, both past and future.",SQL City
2,20171110,robbery,"The Gjallarhorn shoulder-mounted rocket system was forged from\n the armor of Guardians who fell at the Twilight Gap. Gifted\n to the survivors of that terrible battle, the Gjallarhorn\n is seen as a symbol of honor and survival.",SQL City
3,20180103,bribery,"Apparently, Cayde thought it necessary to expose this extremely\n rare vegetable to a Hive summoning ritual.",SQL City
4,20180115,assault,"Hamilton: Lee, do you yield? Burr: You shot him in the side! Yes he yields!",SQL City
5,20180115,assault,Report Not Found,SQL City
6,20180115,murder,"Security footage shows that there were 2 witnesses. The first witness lives at the last house on ""Northwestern Dr"". The second witness, named Annabel, lives somewhere on ""Franklin Ave"".",SQL City
7,20180215,murder,REDACTED REDACTED REDACTED,SQL City
8,20180215,murder,Someone killed the guard! He took an arrow to the knee!,SQL City

In [22]:
query2='''
select * from person where address_street_name="Northwestern Dr" ORDER by address_number desc 
'''
pd.read_sql_query(query2,con)[:1]

,id,name,license_id,address_number,address_street_name,ssn
0,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949

In [11]:
query3='''
select * from person where address_street_name="Franklin Ave" and name like "%Annabel%" ORDER by address_street_name desc 
'''
pd.read_sql_query(query3,con)

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143

In [24]:
query4='''
select * from interview where person_id="16371" or person_id="14887" 
'''
pd.read_sql(query4,con)

,person_id,transcript
0,14887,"I heard a gunshot and then saw a man run out. He had a ""Get Fit Now Gym"" bag. The membership number on the bag started with ""48Z"". Only gold members have those bags. The man got into a car with a plate that included ""H42W""."
1,16371,"I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th."

In [25]:
query5='''
select * from get_fit_now_check_in where check_in_date="20180109" and membership_id like "%48Z%" ORDER BY check_in_date desc
'''
pd.read_sql(query5,con)

  membership_id  check_in_date  check_in_time  check_out_time
0         48Z7A       20180109           1600            1730
1         48Z55       20180109           1530            1700

In [26]:
query6='''
select * from get_fit_now_member where id="48Z7A" or id="48Z55" ORDER BY membership_status desc
'''
pd.read_sql_query(query6,con)

      id  person_id           name  membership_start_date membership_status
0  48Z55      67318  Jeremy Bowers               20160101              gold
1  48Z7A      28819   Joe Germuska               20160305              gold

In [27]:
query7='''
select * from person where id="67318" or id="28819" ORDER BY id desc
'''
pd.read_sql_query(query7,con)

,id,name,license_id,address_number,address_street_name,ssn
0,67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",871539279
1,28819,Joe Germuska,173289,111,Fisk Rd,138909730

In [28]:
query8='''
select * from facebook_event_checkin where person_id="67318" or person_id="28819" ORDER BY person_id desc
'''
pd.read_sql_query(query8,con)

   person_id  event_id              event_name      date
0      67318      4719  The Funky Grooves Tour  20180115
1      67318      1143    SQL Symphony Concert  20171206

In [29]:
query9='''
select * from drivers_license where id="423327" or id="173289" ORDER BY id desc
'''
pd.read_sql_query(query9,con)

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS